text_ru = dict()

text_ru['hey_title'] = '''Привет! Добро пожаловать в программу работы 
с банковскими транзакциями.'''

text_ru['input_file'] = '''Выберите необходимый пункт меню:
1. Получить информацию о транзакциях из JSON-файла
2. Получить информацию о транзакциях из CSV-файла
3. Получить информацию о транзакциях из XLSX-файла")'''

text_ru['input_status'] = '''Введите статус, по которому необходимо выполнить фильтрацию. 
Доступные для фильтровки статусы: EXECUTED, CANCELED, PENDING: '''

text_ru['input_value_error'] = '''Введено не верное значение'''

text_ru['filter_by_status'] = '''Операции отфильтрованы по статусу'''

text_ru['filter_by_status_error'] = '''Статус операции "test" недоступен.'''


text_ru['sorting_data'] ='''Отсортировать операции по дате? Да/Нет '''

text_ru['sort_order'] = '''Отсортировать по возрастанию или по убыванию? (по возрастанию/по убыванию) '''

text_ru['all_or_rub'] = '''Выводить только рублевые транзакции? Да/Нет '''

text_ru['filter_word'] = '''Отфильтровать список транзакций по определенному слову 
в описании? Слово: '''


text_ru['print_transactions'] = '''Распечатываю итоговый список транзакций...'''

text_ru['counter_transactions'] = '''Всего банковских операций в выборке: '''

text_ru['sum'] = 'Сумма: '

text_ru['not_transactions'] = '''Не найдено ни одной транзакции, подходящей под ваши
условия фильтрации'''

yes_ = ['да', 'по убыванию', 'yes']
