text_ru = dict()

text_ru['hey_title'] = '''Программа: Привет! Добро пожаловать в программу работы 
с банковскими транзакциями.'''

text_ru['input_file'] = '''Выберите необходимый пункт меню:
1. Получить информацию о транзакциях из JSON-файла
2. Получить информацию о транзакциях из CSV-файла
3. Получить информацию о транзакциях из XLSX-файла")'''

text_ru['input_status'] = '''Программа: Введите статус, по которому необходимо выполнить фильтрацию. 
Доступные для фильтровки статусы: EXECUTED, CANCELED, PENDING: '''

text_ru['input_value_error'] = '''Введено не верное значение'''

text_ru['filter_by_status'] = '''Операции отфильтрованы по статусу'''

text_ru['filter_by_status_error'] = '''Статус операции "test" недоступен.'''

